export const retrieveLocalStorage = <T>(key: string) => {//це джейнерик, який наперед позволяє вказати який тип данних  ми очікуємо отримати, а також "key" в параметрах каже, що функція приймає ключ із localStorage
    const object = localStorage.getItem(key) || ''//або отримуємо данні з localStorage, або , у випадку якщо в локальному сховищі нічого немає, пусту строку,так як "object" може прийняти лише строку
    if (!object) {//перевірка, чи є в object хоть щось
        return {} as T;//якщо даннич всеж таки немає-вертається пустий обьект
    }
    const parse=JSON.parse(object);//якщо все добре, перетворюємо строку на обьект
    return parse as T;//вертаємо обьект необхідного типу
}
